otakusociety/PST_c--_firmware_platfromio/sdkconfig.defaults
# --- Hardware Identity ---
CONFIG_IDF_TARGET="esp32s3"

# --- PSRAM Configuration (JC3248W535 uses 8MB OPI) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# --- Flash Configuration ---
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# --- CPU and Scheduler ---
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# --- Memory/Heap Management ---
CONFIG_HEAP_TLSF_USE_32BIT_PTR=y

# --- USB & Console ---
# Standard S3 Hardware JTAG/Serial
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- LVGL & DMA Optimization ---
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP32S3_BROWNOUT_DET=y
CONFIG_ESP32S3_BROWNOUT_DET_LVL_SEL_7=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_LV_ATTRIBUTE_FAST_MEM=y
CONFIG_LV_ATTRIBUTE_DMA_CONCAT=y

# --- DMA-Safe PSRAM Buffers ---
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# --- Cache Optimization for DMA ---
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# --- Disable Unnecessary Features ---
# CONFIG_BLE_MESH is not set
# CONFIG_BT_ENABLED is not set

# --- Connectivity ---
CONFIG_TWAI=y

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y